#+title: Example SPARQL queries for IDR
#+property: header-args:sparql :url http://idr-sparql.uni-muenster.de/qlever/sparql :async yes :results output table replace :cache yes :exports both :noweb yes
#+property: header-args:ttl :eval no :noweb yes
#+property: header-args:bash :noweb yes :eval query

* README first!
:PROPERTIES:
:ID:       8235c0c9-0ef5-46f3-a826-8e4b2c67a7be
:END:
This readme file is the source for all example queries in this directory. Example queries should be edited here, not in the /ttl/ files. To (re-)create
the /ttl/ files, run =org-babel-tangle= in emacs.

* Setup
:PROPERTIES:
:ID:       6045d575-e758-402e-a654-0e6cfe179e51
:END:

** SPARQL Prefixes
:PROPERTIES:
:ID:       62a37deb-cf19-46b5-acae-764cdfb04543
:END:
Here we define commonly used prefixes in =sparql= syntax to be included into
=sparql= source code blocks by adding the line =<<idr-prefixes>>= somewhere in
the block (probably somewhere near the top ;).

#+name: idr-prefixes
#+begin_src sparql :eval no
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX dcterms: <http://purl.org/dc/terms/>
  PREFIX dc: <http://purl.org/dc/elements/1.1/>
  PREFIX omecore: <https://ld.openmicroscopy.org/core/>
  PREFIX omekg: <https://ld.openmicroscopy.org/omekg#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace/>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX kv: <http://www.openmicroscopy.org/ns/default/>
  prefix idr: <https://idr.openmicroscopy.org/>
  prefix up: <http://purl.uniprot.org/core/>
  prefix skos: <http://www.w3.org/2004/02/skos/core#>
#+end_src

** TTL prefixes
:PROPERTIES:
:ID:       00c0e6ad-e529-41e3-be5b-907ad2a55bc8
:END:
Common prefixes in =ttl= syntax go here and can be included into =ttl= snippets by adding a =<<ttl-prefixes>>= noweb block.

#+name: ttl-prefixes
#+caption: RDF prefix declarations in turtle syntax
#+begin_src ttl
  @prefix dc: <http://purl.org/dc/elements/1.1/>
  @prefix dcterms: <http://purl.org/dc/terms/>
  @prefix ex: <https://sparql.uniprot.org/.well-known/sparql-examples/> .
  @prefix idr: <https://idr.openmicroscopy.org/>
  @prefix kv: <http://www.openmicroscopy.org/ns/default/>
  @prefix obda: <https://w3id.org/obda/vocabulary#>
  @prefix omecore: <https://ld.openmicroscopy.org/core/>
  @prefix omekg: <https://ld.openmicroscopy.org/omekg#>
  @prefix owl: <http://www.w3.org/2002/07/owl#>
  @prefix rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
  @prefix rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
  @prefix schema: <https://schema.org/> .
  @prefix sh: <http://www.w3.org/ns/shacl#> .
  @prefix xml: <http://www.w3.org/XML/1998/namespace/>
  @prefix xsd: <http://www.w3.org/2001/XMLSchema#>

#+end_src

** IDR SPARQL endpoint URL
:PROPERTIES:
:ID:       9e78c00b-3cee-4c11-a4ea-36ab08362808
:END:
#+name: idr_sparql_endpoint_url
#+begin_src ttl
  <http://idr-sparql.uni-muenster.de/qlever/sparql>
#+end_src

* Example queries
:PROPERTIES:
:ID:       988fb935-973a-49e0-b700-461fdf65f5ec
:END:

** All projects with names and IDs
:PROPERTIES:
:ID:       da8e59c5-d071-4e02-b07e-3cf9c6fb989a
:END:
#+begin_src ttl :noweb-ref 001-comment
  Select all projects and list their names and ids.
#+end_src
#+name: 001-skeleton
#+begin_src ttl :tangle 001--all_projects.ttl :exports none
  <<ttl-prefixes>>

  ex:001 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "<<001-comment>>"^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "project" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<001-sparql>>
  """ .
#+end_src

#+name: 001-sparql
#+begin_src sparql :exports both
  <<idr-prefixes>>

  select ?project ?name ?id where {
    ?project a omecore:Project ;
             rdfs:label ?name ;
             dc:identifier ?id .
    }
  order by ?id
#+end_src


** More project properties
:PROPERTIES:
:ID:       b7228686-56a0-4c7c-959f-5cf8ab1565f3
:END:
#+begin_src sparql
  <<idr-prefixes>>
  select distinct ?project_property where {
    ?project a omecore:Project ;
             ?project_property ?val .
    }
#+end_src

#+RESULTS[e6dbdfb098bc38c764698da601fb14b423eb007b]:
| project_property                                      |
|-------------------------------------------------------|
| http://purl.org/dc/elements/1.1/identifier            |
| http://purl.org/dc/terms/hasPart                      |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type       |
| http://www.w3.org/2000/01/rdf-schema#comment          |
| http://www.w3.org/2000/01/rdf-schema#label            |
| https://ld.openmicroscopy.org/core/experimenter_group |
| https://ld.openmicroscopy.org/core/experimenter       |
| https://ld.openmicroscopy.org/core/hasAnnotation      |


** Gene annotations and federation to uniprot
:PROPERTIES:
:ID:       22fb3c6f-c693-4d57-9f12-8fb3c51cd478
:END:

:PROPERTIES:
:ID:       bdfc0f49-47af-4728-8828-416ee0aa1e20
:#END:

#+name: sparql.uniprot.protein_gene

#+begin_src sparql :url https://sparql.uniprot.org/sparql :cache no
  <<idr-prefixes>>
  select distinct ?up_protein  where {
          ?up_protein a up:Protein ;
                      up:reviewed true ;
                      rdfs:seeAlso ?xref .
    filter(contains(str(?xref), "ENSG00000111581"))
  }
  limit 10
  #+end_src

#+RESULTS:
| up_protein                             |
|----------------------------------------|
| http://purl.uniprot.org/uniprot/P57740 |


    #+begin_src sparql
      <<idr-prefixes>>
      prefix omekv: <https://ld.openmicroscopy.org/kv#>
      select distinct ?img ?value ?up_protein where {
        <https://idr.openmicroscopy.org/Project/52>
                 dcterms:hasPart/dcterms:hasPart ?img .
        ?img a omecore:Image ;
             omecore:hasAnnotation/omecore:mapEntry [omecore:key ?key; omecore:value ?value] .

        filter(?key="Gene Identifier")

        service <https://sparql.uniprot.org/sparql> {
          select ?up_protein where {
            ?up_protein a up:Protein ;
                        up:reviewed true ;
                        rdfs:seeAlso ?xref .
            filter(contains(str(?xref), str(?value)))
          }
        }
      }
      limit 10
#+end_src

#+RESULTS[d803f728d1d30e5a78d6aed13479af294a266e00]:
| img | value | up_protein |
|-----+-------+------------|


