#+title: Example SPARQL queries for IDR
#+property: header-args:sparql :url http://idr-sparql.uni-muenster.de/qlever/sparql :async yes :results output table replace :cache yes :exports both :noweb yes :eval no-export :wrap example
#+property: header-args:ttl :eval no :noweb yes
#+property: header-args:bash :noweb yes :eval query
#+bibliography: /home/grotec/data/sync/documents/reference_db/bib/jabref.bib
#+OPTIONS: toc:t email:nil author:nil

#+latex_header: \usepackage{minted}
#+latex_header: \usepackage[style=authoryear,maxcitenames=1,url=false,eprint=false]{biblatex}
#+latex_header: \usepackage[record=nameref]{glossaries-extra}
#+latex_header: \setabbreviationstyle[acronym]{short-footnote}
#+latex_header: \GlsXtrLoadResources[src={/home/grotec/texmf/tex/latex/glossary/glosabv.bib}]
#+latex_header: \addbibresource{jabref.bib}

# Authors and affiliations
#+latex_header: \usepackage{orcidlink}
#+latex_header: \usepackage{rorlink}
#+latex_header: \usepackage{authblk}

#+latex_header: \author[1]{Carsten Fortmann-Grote\orcidlink{0000-0002-2579-5546}}
#+latex_header: \affil[1]{Max Planck Institute for Evolutionary Biology, Plön, Germany\rorlink{https://ror.org/0534re684}}
#+latex_header: \usepackage{cleveref}
#+latex_header: \usepackage[]{hyperref}
#+latex_header: \usepackage{xcolor}
#+latex_header: \hypersetup{
#+latex_header:     colorlinks,
#+latex_header:     linkcolor={red!50!black},
#+latex_header:     citecolor={blue!50!black},
#+latex_header:     urlcolor={blue!80!black}
#+latex_header: }
#+latex_header: \usepackage{hyperxmp}
#+latex_header: \usepackage{marvosym}
#+latex_header: \usepackage{minted}
#+latex_header: \usepackage{parskip}
#+latex_header: \usepackage{pgfpages}
#+latex_header: \usepackage{tikz}
#+latex_header: \usetikzlibrary{arrows}
#+latex_header: \usetikzlibrary{calc}
#+latex_header: \usetikzlibrary{positioning}
#+latex_header: \usetikzlibrary{shapes.geometric}
#+latex_header: \usepackage[margin=2cm]{geometry}
* README first!
:PROPERTIES:
:ID:       8235c0c9-0ef5-46f3-a826-8e4b2c67a7be
:END:
This readme file is the source for all example queries in this directory. Example queries should be edited here, not in the /ttl/ files. To (re-)create
the /ttl/ files, run =org-babel-tangle= in emacs.

* Setup
:PROPERTIES:
:ID:       6045d575-e758-402e-a654-0e6cfe179e51
:END:

** SPARQL Prefixes
:PROPERTIES:
:ID:       62a37deb-cf19-46b5-acae-764cdfb04543
:END:
Here we define commonly used prefixes in =sparql= syntax to be included into
=sparql= source code blocks by adding the line =<<sparql-prefixes>>= somewhere in
the block (probably somewhere near the top ;).

#+name: sparql-prefixes
#+begin_src sparql :eval no
  PREFIX owl: <http://www.w3.org/2002/07/owl#>
  PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>
  PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#>
  PREFIX dcterms: <http://purl.org/dc/terms/>
  PREFIX dc: <http://purl.org/dc/elements/1.1/>
  PREFIX omecore: <https://ld.openmicroscopy.org/core/>
  PREFIX omekg: <https://ld.openmicroscopy.org/omekg#>
  PREFIX obda: <https://w3id.org/obda/vocabulary#>
  PREFIX xml: <http://www.w3.org/XML/1998/namespace/>
  PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
  PREFIX kv: <http://www.openmicroscopy.org/ns/default/>
  PREFIX idr: <https://idr.openmicroscopy.org/>
  PREFIX up: <http://purl.uniprot.org/core/>
  PREFIX skos: <http://www.w3.org/2004/02/skos/core#>
#+end_src

** TTL prefixes
:PROPERTIES:
:ID:       00c0e6ad-e529-41e3-be5b-907ad2a55bc8
:END:
Common prefixes in =ttl= syntax go here and can be included into =ttl= snippets by adding a =<<ttl-prefixes>>= noweb block.

#+name: ttl-prefixes
#+caption: RDF prefix declarations in turtle syntax
#+begin_src ttl
  @PREFIX dc: <http://purl.org/dc/elements/1.1/>
  @PREFIX dcterms: <http://purl.org/dc/terms/>
  @PREFIX ex: <https://sparql.uniprot.org/.well-known/sparql-examples/> .
  @PREFIX idr: <https://idr.openmicroscopy.org/>
  @PREFIX kv: <http://www.openmicroscopy.org/ns/default/>
  @PREFIX obda: <https://w3id.org/obda/vocabulary#>
  @PREFIX omecore: <https://ld.openmicroscopy.org/core/>
  @PREFIX omekg: <https://ld.openmicroscopy.org/omekg#>
  @PREFIX owl: <http://www.w3.org/2002/07/owl#>
  @PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> .
  @PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> .
  @PREFIX schema: <https://schema.org/> .
  @PREFIX sh: <http://www.w3.org/ns/shacl#> .
  @PREFIX xml: <http://www.w3.org/XML/1998/namespace/>
  @PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>

#+end_src

** IDR SPARQL endpoint URL
:PROPERTIES:
:ID:       9e78c00b-3cee-4c11-a4ea-36ab08362808
:END:
#+name: idr_sparql_endpoint_url
#+begin_src ttl
  <http://idr-sparql.uni-muenster.de/qlever/sparql>
#+end_src

* Example queries
:PROPERTIES:
:ID:       988fb935-973a-49e0-b700-461fdf65f5ec
:END:

** All projects with names and IDs
:PROPERTIES:
:ID:       da8e59c5-d071-4e02-b07e-3cf9c6fb989a
:END:
#+begin_src ttl :noweb-ref 001-comment
  Select all projects and list their names and ids.
#+end_src
#+name: 001-skeleton
#+begin_src ttl :tangle 001--all_projects.ttl :exports none
  <<ttl-prefixes>>

  ex:001 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "<<001-comment>>"^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "project" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<001-sparql>>
  """ .
#+end_src

#+name: 001-sparql
#+begin_src sparql :exports both
  <<sparql-prefixes>>

  select ?id ?name  where {
    ?project a omecore:Project ;
             rdfs:label ?name ;
             dc:identifier ?id .
    }
  order by ?id
  limit 20
#+end_src

#+RESULTS[94a23f11322ceab2d725e8e35bea1c4a34803a15]: 001-sparql
#+begin_example
|  id | name                                             |
|-----+--------------------------------------------------|
|  51 | idr0021-lawo-pericentriolarmaterial/experimentA  |
|  52 | idr0023-szymborska-nuclearpore/experimentA       |
| 101 | idr0018-neff-histopathology/experimentA          |
| 151 | idr0027-dickerson-chromatin/experimentA          |
| 201 | idr0032-yang-meristem/experimentA                |
| 301 | idr0026-weigelin-immunotherapy/experimentA       |
| 351 | idr0038-held-kidneylightsheet/experimentA        |
| 352 | idr0038-held-kidneylightsheet/experimentB        |
| 353 | idr0038-held-kidneylightsheet/experimentC        |
| 354 | idr0038-held-kidneylightsheet                    |
| 401 | idr0040-aymoz-singlecell/experimentA             |
| 402 | idr0042-nirschl-wsideeplearning/experimentA      |
| 404 | idr0041-cai-mitoticatlas/experimentA             |
| 405 | idr0045-reichmann-zygotespindle/experimentA      |
| 501 | idr0043-uhlen-humanproteinatlas/experimentA      |
| 502 | idr0044-mcdole-tardislightsheet/experimentA      |
| 503 | idr0047-neuert-yeastmrna/experimentA             |
| 504 | idr0053-faas-virtualnanoscopy/experimentA        |
| 505 | idr0050-springer-cytoskeletalsystems/experimentA |
| 552 | idr0051-fulton-tailbudlightsheet/experimentA     |
#+end_example

** More project properties
:PROPERTIES:
:ID:       b7228686-56a0-4c7c-959f-5cf8ab1565f3
:END:
#+begin_src sparql
  <<sparql-prefixes>>
  select distinct ?project_property where {
    ?project a omecore:Project ;
             ?project_property ?val .
    }
#+end_src

#+RESULTS[136b551335c8006794a36bf9ac1cb07cfcb4c2a2]:
#+begin_example
| project_property                                      |
|-------------------------------------------------------|
| http://purl.org/dc/elements/1.1/identifier            |
| http://purl.org/dc/terms/hasPart                      |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type       |
| http://www.w3.org/2000/01/rdf-schema#comment          |
| http://www.w3.org/2000/01/rdf-schema#label            |
| https://ld.openmicroscopy.org/core/experimenter_group |
| https://ld.openmicroscopy.org/core/experimenter       |
| https://ld.openmicroscopy.org/core/hasAnnotation      |
#+end_example

** Unique annotation keys 
:PROPERTIES:
:ID:       3ac9ffd4-1a54-443f-b1f9-4952a58d0779
:END:


#+name: sparql.idr.image.number_of_keys
#+begin_src sparql
  <<sparql-prefixes>>

  select (count(distinct ?key) as ?nkey) where {
    ?img a omecore:Image;
         omecore:hasAnnotation/omecore:mapEntry/omecore:key ?key .
    }
#+end_src

#+RESULTS[1e27da5263ced86e2abf7f79b488378b1130c509]: sparql.idr.image.number_of_keys
#+begin_example
| nkey |
|------|
|  549 |
#+end_example


*** ttl wrapper                                                      :noexport:
:PROPERTIES:
:ID:       e0b87ffd-c50d-4c2a-a583-ea30ed4e2387
:END:
#+name: ttl.idr.image.number_of_keys
#+begin_src ttl :tangle 003-image-number-of-keys.ttl :exports none
  <<ttl-prefixes>>
  ex:003 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "Count the number of unique image map annotation keys"^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "image, mapAnnotation, key, unique, count" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<sparql.idr.image.number_of_keys>>
  """ .
#+end_src


** Unique annotation keys and usage frequency
:PROPERTIES:
:ID:       3ac9ffd4-1a54-443f-b1f9-4952a58d0779
:END:


#+name: sparql.idr.image.key_usage
#+begin_src sparql
    <<sparql-prefixes>>
  SELECT ?key (COUNT(?value) AS ?n_usage)
  WHERE {
    ?img a omecore:Image;
         omecore:hasAnnotation/omecore:mapEntry [
             omecore:key ?key;
             omecore:value ?value
         ] .
  }
  GROUP BY ?key
  ORDER BY DESC(?n_usage)
  LIMIT 20
#+end_src

#+RESULTS[d17e42af230b1b4878753f49f2fc216a7272f803]: sparql.idr.image.key_usage
#+begin_example
| key                         |  n_usage |
|-----------------------------+----------|
| Organism                    | 14187208 |
| Gene Identifier URL         | 13179301 |
| Gene Symbol                 | 10743692 |
| Gene Identifier             | 10743692 |
| Cell Line                   |  7577518 |
| Organism Part               |  6475946 |
| Organism Part Identifier    |  6452324 |
| Pathology Identifier        |  6407573 |
| Pathology                   |  6407573 |
| Sex                         |  6171454 |
| Age                         |  6147978 |
| Antibody Identifier         |  5947474 |
| Antibody Identifier URL     |  5946893 |
| Dilution Factor             |  5941710 |
| Individual                  |  5935036 |
| Human Protein Atlas version |  5931242 |
| Retrieval Method            |  5931242 |
| Ensembl version             |  5931242 |
| Channels                    |  4171941 |
| Compound Name               |  3619585 |
#+end_example

*** ttl wrapper                                                      :noexport:
:PROPERTIES:
:ID:       e0b87ffd-c50d-4c2a-a583-ea30ed4e2387
:END:
#+name: ttl.idr.image.keys_usage
#+begin_src ttl :tangle 007-image-keys-usage.ttl :exports none
  <<ttl-prefixes>>
  ex:003 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "Image map annotation keys and usage counts"^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "image, mapAnnotation, key, unique, count" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<sparql.idr.image.key_usage>>
  """ .
#+end_src

** Map Annotation keys of a given image
:PROPERTIES:
:ID:       d7ad11ad-5cc8-409e-8dfe-11a321d2491e
:END:
List all keys used to annotate a given IDR image.

#+name: sparql.idr.select_image.keys
#+begin_src sparql
  <<sparql-prefixes>>
  PREFIX idrimage: <https://idr.openmicroscopy.org/Image/>

  select distinct ?key where {
    idrimage:1000000 omecore:hasAnnotation/omecore:mapEntry/omecore:key ?key
    }
#+end_src

#+RESULTS[e7da7e98ad81be3585aa5e5b9750f0ce204145e7]: sparql.idr.select_image.keys
#+begin_example
| key                                                   |
|-------------------------------------------------------|
| Cell Line                                             |
| Channels                                              |
| Gene Identifier                                       |
| Gene Identifier URL                                   |
| Gene Symbol                                           |
| hORFeome V5.1 Clone Description                       |
| ORF Comments                                          |
| ORF Identifier                                        |
| ORF Identifier URL                                    |
| Organism                                              |
| Scored As Nuclear Foci At Initial Stage               |
| Subcellular Localization Based On Secondary Screening |
#+end_example


*** ttl wrapper                                                    :noexport:
:PROPERTIES:
:ID:       1b3cd5f4-c1ad-4b82-b5b6-fd3678ed43b7
:END:
#+name: ttl.idr.select_image.keys

#+begin_src ttl :tangle 004-image-keys.ttl :exports none
  <<ttl-prefixes>>

  ex:004 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "Map annotation keys for IDR Image:1000000"^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "image, mapAnnotation, keys" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<sparql.idr.select_image.keys>>
  """ .
#+end_src


** Unique Gene Symbols
:PROPERTIES:
:ID:       89685530-193c-4c77-a7d6-8200ea34057a
:END:
Which genes are referenced in the IDR?

#+name: sparql.idr.image.gene_symbols
#+begin_src sparql
  <<sparql-prefixes>>

  select distinct ?gene_identifier where {
    ?img a omecore:Image ;
         omecore:hasAnnotation/omecore:mapEntry [omecore:key ?key; omecore:value ?gene_identifier] ;
    values ?key {"Gene Symbol"}
  }
  limit 20
#+end_src

#+RESULTS[03641f8257ba827a45be1c0c4e02455af5942ea2]: sparql.idr.image.gene_symbols
#+begin_example
| gene_identifier |
|-----------------|
|                 |
| 128up           |
| 14-3-3epsilon   |
| 14-3-3zeta      |
| 140up           |
| 15E2_HUMAN      |
| 18w             |
| 26-29-p         |
| 2mit            |
| 312             |
| 4EHP            |
| 5-HT1A          |
| 5-HT1B          |
| 5-HT2           |
| 5-HT2A          |
| 5-HT2B          |
| 5-HT7           |
| 5PtaseI         |
| 76P             |
| 7A5             |
#+end_example

** Map gene accessions to uniprot
:PROPERTIES:
:ID:       8a927d9b-97df-4fc6-9a31-0757d6cdf499
:END:
Gene Identifier URLs sometimes fail to resolve because of errors in resolution or because of paywall restrictions. An example is
the Arabidopsis Thaliana Internet Resource (https://arabidopsis.org, TAIR). This query translates TAIR accessions to uniprot IDs.

#+name: sparql.idr.tair2uniprot
#+begin_src sparql
  <<sparql-prefixes>>
  PREFIX idrprj: <https://idr.openmicroscopy.org/Project/>
  prefix database: <http://purl.uniprot.org/database/>
  prefix taxon: <http://purl.uniprot.org/taxonomy/>

  select distinct ?tair_accession ?protein where {
    idrprj:201 dcterms:hasPart/dcterms:hasPart ?img .
    ?img omecore:hasAnnotation/omecore:mapEntry [omecore:key ?key; omecore:value ?gene_identifier] ;
         ^dcterms:hasPart/^dcterms:hasPart ?prj .
    values ?key {"Gene Identifier"}
    bind(iri(concat("http://purl.uniprot.org/tair/", ?gene_identifier)) as ?tair_accession)

    service <https://sparql.uniprot.org/sparql> {
      ?protein a up:Protein;
               rdfs:seeAlso ?tair_accession ;
               up:organism taxon:3702 .
      ?tair_accession up:database database:TAIR ;
      }
  }
  limit 20
#+end_src

#+RESULTS[5eb0702b213bb1b01ddec6173252445a262d6783]: sparql.idr.tair2uniprot
#+begin_example
| tair_accession                         | protein                                    |
|----------------------------------------+--------------------------------------------|
| http://purl.uniprot.org/tair/AT1G02720 | http://purl.uniprot.org/uniprot/Q9FWY9     |
| http://purl.uniprot.org/tair/AT1G02720 | http://purl.uniprot.org/uniprot/W8Q7E9     |
| http://purl.uniprot.org/tair/AT1G02730 | http://purl.uniprot.org/uniprot/Q9SRW9     |
| http://purl.uniprot.org/tair/AT1G02730 | http://purl.uniprot.org/uniprot/W8QPC8     |
| http://purl.uniprot.org/tair/AT1G03520 | http://purl.uniprot.org/uniprot/A8MQE8     |
| http://purl.uniprot.org/tair/AT1G03520 | http://purl.uniprot.org/uniprot/Q9LR71     |
| http://purl.uniprot.org/tair/AT1G05170 | http://purl.uniprot.org/uniprot/A0A2H1ZEA5 |
| http://purl.uniprot.org/tair/AT1G05170 | http://purl.uniprot.org/uniprot/A8MRC7     |
| http://purl.uniprot.org/tair/AT1G05170 | http://purl.uniprot.org/uniprot/W8Q3U9     |
| http://purl.uniprot.org/tair/AT1G05570 | http://purl.uniprot.org/uniprot/F4I8T3     |
| http://purl.uniprot.org/tair/AT1G05570 | http://purl.uniprot.org/uniprot/Q9AUE0     |
| http://purl.uniprot.org/tair/AT1G06780 | http://purl.uniprot.org/uniprot/F4IDS0     |
| http://purl.uniprot.org/tair/AT1G06780 | http://purl.uniprot.org/uniprot/Q9M9Y5     |
| http://purl.uniprot.org/tair/AT1G06780 | http://purl.uniprot.org/uniprot/W8PW41     |
| http://purl.uniprot.org/tair/AT1G08280 | http://purl.uniprot.org/uniprot/Q9SGD2     |
| http://purl.uniprot.org/tair/AT1G08660 | http://purl.uniprot.org/uniprot/A0A1P8AM36 |
| http://purl.uniprot.org/tair/AT1G08660 | http://purl.uniprot.org/uniprot/F4HXN8     |
| http://purl.uniprot.org/tair/AT1G08660 | http://purl.uniprot.org/uniprot/Q8VZJ0     |
| http://purl.uniprot.org/tair/AT1G11730 | http://purl.uniprot.org/uniprot/Q9SAA4     |
| http://purl.uniprot.org/tair/AT1G11730 | http://purl.uniprot.org/uniprot/W8Q7D4     |
#+end_example

*** ttl wrapper                                                      :noexport:
:PROPERTIES:
:ID:       61abe123-b04d-4eb4-9963-3137adf935e1
:END:
#+name: ttl.idr.tair2uniprot
#+begin_src ttl :exports none :eval no :tangle 005-idr-tair2uniprot.ttl
  <<ttl-prefixes>>

  ex:005 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "Map image Gene Identifer URLs from Project:201 from TAIR accessions to uniprot protein IDs."^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "accessions, mapping, uniprot. arabidopsis thaliana" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<sparql.idr.tair2uniprot>>
  """ .
#+end_src
** Gene annotations and federation to uniprot
:PROPERTIES:
:ID:       22fb3c6f-c693-4d57-9f12-8fb3c51cd478
:END:

In this query, we use the gene identifier annotations of images in a IDR Project
to find the protein encoded by the annotated gene. We're making use of the fact that Uniprot
proteins are cross referenced to genes in the =bgee= database and the bgee accession numbers are
the gene identifiers, e.g.
#+begin_src ttl :eval no
  @prefix up: <http://purl.uniprot.org/uniprot/> .
  @prefix bgee: <http://purl.uniprot.org/bgee/> .
  ...
  <P57740> a up:Protein ;
      ...
      rdfs:seeAlso bgee:<http://purl.uniprot.org/bgee/ENSG00000111581> ,
      ...
#+end_src

This enables queries to Uniprot that find a protein encoded by a gene with a given gene identifier:
#+name: sparql.uniprot.protein_gene
#+caption: Query against Uniprot SPARQL endpoint to retrieve proteins encoded by gene with ID ENSG00000111581.
#+begin_src sparql :url https://sparql.uniprot.org/sparql :cache no :eval no-export
  <<sparql-prefixes>>
  prefix bgee: <http://purl.uniprot.org/bgee/>

  select distinct ?up_protein  where {
          ?up_protein a up:Protein ;
                      up:reviewed true ;
                      rdfs:seeAlso ?xref .
    filter(contains(str(?xref), "ENSG00000111581"))
  }
  limit 10
  #+end_src

#+RESULTS: sparql.uniprot.protein_gene
#+begin_example
| up_protein                             |
|----------------------------------------|
| http://purl.uniprot.org/uniprot/P57740 |
#+end_example


We wrap Query Cref:sparql.uniprot.protein_gene in a =service= statement as follows, to find the protein encoded by a gene being referenced
in the "Gene Identifier" key-value annotation:

#+name: sparql.idr-to-uniprot.protein_gene
    #+begin_src sparql
  <<sparql-prefixes>>
  prefix bgee: <http://purl.uniprot.org/bgee/>

  select distinct ?img ?up_protein where {
    <https://idr.openmicroscopy.org/Project/52>
    dcterms:hasPart/dcterms:hasPart ?img .
    ?img a omecore:Image ;
         omecore:hasAnnotation/omecore:mapEntry [omecore:key ?key; omecore:value ?value] .
    filter(?key = "Gene Identifier")
    bind(iri(concat(str(bgee:),?value)) as ?bgee) .

    SERVICE <https://qlever.dev/api/uniprot> {
      ?up_protein a up:Protein ;
                  up:reviewed true ;
                  rdfs:seeAlso ?bgee .
      }
  }
  limit 20
#+end_src

#+RESULTS[626247dca63fe2da2f7a17b71c1f31383163c5ab]: sparql.idr-to-uniprot.protein_gene
#+begin_example
| img                                          | up_protein                             |
|----------------------------------------------+----------------------------------------|
| https://idr.openmicroscopy.org/Image/1885617 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885618 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885619 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885620 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885621 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885622 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885623 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885624 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885625 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885626 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885627 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885628 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885629 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885630 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885631 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885632 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885633 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885634 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885635 | http://purl.uniprot.org/uniprot/P57740 |
| https://idr.openmicroscopy.org/Image/1885636 | http://purl.uniprot.org/uniprot/P57740 |
#+end_example


*** ttl wrapper                                                      :noexport:
:PROPERTIES:
:ID:       afe12060-acd9-49d7-8ba0-f239b9a4e6ba
:END:
#+begin_src ttl :eval no :tangle 002--idr-uniprot.ttl
   <<ttl-prefixes>>

  ex:002 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "Federated query connecting to Uniprot proteins via Gene Identifier key-value annotation."^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "key-value annotations, uniprot, federated query, proteins" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
      <<sparql.idr-to-uniprot.protein_gene>>
      """
#+end_src

** All Gene Identifier URLs
:PROPERTIES:
:ID:       3243f0c6-bb8f-4482-b4ad-6d9b5a6ccf36
:END:
How many gene identifier URLs fail to resolve?

#+name: sparql.idr.gene-identifiers
#+begin_src sparql :results output text file :file gene_identifier_urls.txt
  <<sparql-prefixes>>

  select distinct ?url
  where {
    ?img a omecore:Image ;
         omecore:hasAnnotation/omecore:mapEntry [omecore:key ?key; omecore:value ?url] .
    values ?key {"Gene Identifier URL"}
    }
#+end_src

#+RESULTS[50f3a25c981743eb394b20a2a828e6e0ac7cac2b]:
[[file:gene_identifier_urls.txt]]

*** Collect response code from gene identifier urls
:PROPERTIES:
:ID:       df9d6811-eadd-4dae-a54a-cd6a54f77d7e
:END:
#+begin_src bash :results file link :file response.txt :eval no
      while read line
      do curl -o /dev/null -s -w "%{http_code}\n" $line >> response.txt
      done < gene_identifier_urls.txt 
#+end_src

*** ttl wrapper                                                      :noexport:
:PROPERTIES:
:ID:       7fcb7ff3-813e-400b-be47-b64d0ec95616
:END:
#+name: ttl.idr.gene-identifier-urls
#+begin_src ttl :eval no :exports none :tangle 006-idr-gene-identifier-urls.ttl
  <<ttl-prefixes>>

  ex:006 a sh:SPARQLExecutable, sh:SPARQLSelectExecutable ;
      rdfs:comment "Get all unique gene identifier urls."^^rdf:HTML ;
      sh:prefixes _:sparql_example_prefixes ;
      schema:keywords "image, gene, identifier, url, accessions, response" ;
      schema:target <<idr_sparql_endpoint_url>> ;
      sh:select """
  <<sparql.idr.gene-identifiers>>
  """ .
#+end_src
